<?php

declare(strict_types=1);

return [

    'menu' => 'Атрибути',
    'single' => 'атрибут',
    'title' => 'Управління атрибутами',
    'content' => 'Додайте кастомні атрибути до товарів для відображення інформації',
    'add' => 'Додати атрибут',
    'update' => 'Оновити атрибут :attribute',
    'searchable_description' => 'Ви можете використовувати цей атрибут для пошуку та фільтрації товарів.',
    'filtrable_description' => 'Ви можете використовувати цей атрибут як фільтр у вашому магазині.',
    'attribute_visibility' => 'Налаштувати видимість атрибута для клієнтів.',
    'attribute_value' => 'ID значення атрибута',
    'description' => 'Атрибути, повʼязані з вашим товаром. Після вибору ці атрибути можна комбінувати для генерації варіантів.',

    'values' => [
        'slug' => 'Значення',
        'title' => 'Значення атрибутів',
        'description' => 'Додайте типові значення для цього атрибута. Ці значення будуть доступні на вкладках атрибутів товару.',
    ],

    'notifications' => [
        'save' => 'Атрибут успішно збережено',
        'value_created' => 'Нове значення додано для :name',
        'value_updated' => 'Значення успішно оновлено',
        'value_removed' => 'Значення успішно видалено',
    ],

];
