<?php

declare(strict_types=1);

return [

    'login' => [
        'title' => 'Вхід через email',
        'subtitle' => 'Вхід до панелі адміністрації Shopper',
        'or' => 'Або',
        'return_landing' => 'Повернутися на головну сторінку',
        'forgot_password' => 'Забули пароль?',
        'action' => 'Вхід',
        'failed' => 'Ці облікові дані не відповідають нашим записам.',
        'throttled' => 'Забагато спроб входу. Спробуйте ще раз через :seconds секунд.',
        'return_login' => 'Назад до входу',
    ],

    'reset' => [
        'title' => 'Скидання пароля',
        'message' => 'Введіть email та новий пароль, який ви хочете використовувати для доступу до акаунта.',
        'action' => 'Оновити пароль',
    ],

    'email' => [
        'title' => 'Скидання пароля',
        'message' => 'Введіть email нижче, і ми відправимо інструкції для скидання пароля.',
        'action' => 'Відправити email для скидання пароля',
        'return_to_login' => 'Повернутися до входу',
        'mail' => [
            'subject' => 'Скидання пароля',
            'content' => 'Ви отримали цей email, оскільки ми отримали запит на скидання пароля для вашого акаунта.',
            'action' => 'Скинути пароль',
            'message' => 'Якщо ви не запитували скидання пароля, ніяких додаткових дій не потрібно.',
        ],
    ],

    'two_factor' => [
        'title' => 'Вхід з двофакторною автентифікацією',
        'subtitle' => 'Підтвердіть ваш акаунт',
        'authentication_code' => 'Підтвердіть доступ до акаунта, ввівши код автентифікації з вашого додатку.',
        'recovery_code' => 'Підтвердіть доступ до акаунта, ввівши один із кодів аварійного відновлення.',
        'remember' => 'Не памʼятаєте цей код?',
        'use_recovery_code' => 'Використати код відновлення',
        'use_authentication_code' => 'Використати код автентифікації',
        'action' => 'Вхід',
        'recovery_not_enabled' => 'Коди відновлення не увімкнено для цього акаунта.',
        'invalid_recovery_code' => 'Вказаний код відновлення двофакторної автентифікації недійсний.',
        'invalid_code' => 'Вказаний код двофакторної автентифікації недійсний.',
    ],

    'account' => [
        'meta_title' => 'Профіль акаунта',
        'title' => 'Мій профіль',

        'device_title' => 'Пристрої',
        'device_description' => 'Ви зараз ввійшли на цих пристроях. Якщо ви не впізнаєте пристрій, вийдіть, щоб захистити акаунт.',
        'empty_device' => 'При необхідності ви можете вийти з усіх інших браузерних сесій на всіх ваших пристроях.',
        'current_device' => 'Цей пристрій',
        'device_last_activity' => 'Остання активність',
        'device_location' => 'Неможливо визначити це місцезнаходження.',
        'device_enabled_feature' => 'Для активації цієї функції потрібен драйвер сесій database.',

        'password_title' => 'Оновлення пароля',
        'password_description' => 'Використовуйте довгий випадковий пароль для безпеки акаунта.',
        'password_helper_validation' => 'Пароль має бути довшим за 8 символів і містити щонайменше 1 велику літеру, 1 малу літеру та 1 цифру.',

        'two_factor_title' => 'Двофакторна автентифікація',
        'two_factor_description' => 'Після введення пароля підтвердіть ідентифікацію другим методом автентифікації.',
        'two_factor_enabled' => 'Двофакторну автентифікацію увімкнено.',
        'two_factor_disabled' => 'Двофакторну автентифікацію не увімкнено.',
        'two_factor_install_message' => 'Для двофакторної автентифікації необхідно встановити додаток Google Authenticator на смартфон.',
        'two_factor_secure' => 'З двофакторною автентифікацією лише ви можете отримати доступ до акаунта — навіть якщо кто-то знає ваш пароль.',
        'two_factor_activation_message' => 'Коли двофакторну автентифікацію увімкнено, під час автентифікації вам буде запропоновано ввести безпечний токен. Ви можете отримати цей токен з додатку Google Authenticator на телефоні.',
        'two_factor_is_enabled' => 'Двофакторну автентифікацію увімкнено. Скануйте QR-код нижче додатком автентифікації на телефоні.',
        'two_factor_store_recovery_codes' => 'Збережіть ці коди відновлення в безпечному менеджері паролів. Їх можна використати для відновлення доступу до акаунта, якщо пристрій двофакторної автентифікації буде втрачено.',

        'profile_title' => 'Інформація профілю',
        'profile_description' => 'Оновіть інформацію профілю та email акаунта.',
    ],

];
