<?php

declare(strict_types=1);

return [

    'menu' => 'Колекції',
    'single' => 'колекція',
    'title' => 'Організуйте товари в колекції',
    'content' => 'Створіть та управляйте колекціями, щоб клієнтам було легше знаходити групи або типи товарів.',
    'automatic' => 'Автоматична',
    'automatic_description' => 'Товари, що відповідають заданим умовам, автоматично додаються до колекції.',
    'manual' => 'Ручна',
    'manual_description' => 'Додайте товари до цієї колекції по одному.',
    'filter_type' => 'Тип колекції',
    'product_conditions' => 'Умови товарів',
    'availability_description' => 'Вкажіть дату публікації, щоб колекції були заплановані в магазині.',
    'zone_description' => 'Обмежте цю колекцію лише вибраними зонами.',
    'empty_collections' => 'У цій колекції немає товарів. Додайте або змініть умови для динамічного додавання товарів.',
    'remove_product' => 'Товар успішно видалено з цієї колекції.',

    'conditions' => [
        'title' => 'Умови',
        'products_match' => 'Товари мають відповідати',
        'all' => 'Всі умови',
        'any' => 'Будь-яка умова',
        'rules' => 'Правила',
        'choose_rule' => 'Виберіть правило',
        'select_operator' => 'Виберіть оператор',
        'add' => 'Додати умову',
        'add_another' => 'Додати ще одну умову',
        'update' => 'Умови успішно оновлено',
    ],

    'modal' => [
        'title' => 'Додати товари до колекції',
        'search' => 'Пошук товару',
        'search_placeholder' => 'Пошук товару по назві',
        'action' => 'Додати вибрані товари',
        'stock' => ':stock доступно',
        'success_message' => 'Вибрані товари додано',
    ],
];
