<?php

declare(strict_types=1);

return [

    'title' => 'Ініціалізація магазину',
    'step_one_title' => 'Інформація',
    'step_one_description' => 'Вкажіть корисну інформацію для вашого магазину.',
    'step_two_title' => 'Адреса',
    'step_two_description' => 'Вкажіть адресу магазину.',
    'step_tree_title' => 'Соціальні посилання',
    'step_tree_description' => 'Посилання на ваші соціальні мережі.',

    'step' => 'Крок :step з 3',
    'shop_configuration' => 'Налаштування магазину',
    'step_1' => 'Крок 1 — Інформація про магазин',
    'tell_about' => 'Розкажіть про ваш магазин',
    'step_1_description' => 'Ця інформація буде корисна, якщо ви хочете, щоб клієнти могли звʼязатися з вами напряму по email або телефону.',

    'step_2' => 'Крок 2 — Адреса',
    'address_description' => 'Необхідно вказати адресу та місцезнаходження магазину',
    'step_2_description' => 'Не бійтеся. Ви можете змінити ці налаштування в будь-який час. Shopper дозволяє почати з мінімального рівня, щоб ви могли бачити розвиток магазину.',

    'step_3' => 'Крок 3 — Соціальні посилання',
    'social_description' => 'Ваш магазин у соціальних мережах',
    'step_3_description' => 'Ви можете додати посилання на соціальні мережі, щоб магазин легко знаходили на ваших сторінках.',
    'action' => 'Зберегти',

    'about_description' => 'Ви можете додати цю інформацію на сторінку «Про нас» на вашому сайті.',
    'currencies_description' => 'Це валюти, в яких товари будуть продаватися в магазині.',
    'currency_description' => 'Це основна валюта, яка буде відображатися в магазині.',
    'default_currency_must_be_in_currencies' => 'Основна валюта має бути однією з вибраних валют.',

];
