<?php

declare(strict_types=1);

return [

    'menu' => 'Товари',
    'single' => 'товар',
    'title' => 'Управління каталогом',
    'content' => 'Додайте та управляйте товарами, щоб наблизитися до першого продажу.',
    'about_pricing' => 'Про відображення цін',
    'about_pricing_content' => 'Всі ціни за замовчуванням у центах. Для збереження 10€ (або 10$) необхідно ввести 1000 центів для коректного форматування валюти.',

    'amount_price_help_text' => 'Ціна покупки, до знижок.',
    'compare_price_help_text' => 'Рекомендована ціна продажу для порівняння з ціною покупки. Зазвичай ця цена вища.',
    'cost_per_items_help_text' => 'Оригінальна виробнича ціна. Клієнти її не бачать.',
    'safety_security_help_text' => 'Страховий запас — лімітний склад товарів, який сповіщає, коли товар скоро закінчиться.',
    'quantity_inventory' => 'Кількість на складі',
    'manage_inventories' => 'Управління складами',
    'inventory_name' => 'Назва склада',
    'product_can_returned' => 'Цей товар можна повернути',
    'product_can_returned_help_text' => 'Користувачі можуть повернути цей товар у разі проблеми або незадоволення.',
    'product_shipped' => 'Цей товар буде доставлено',
    'product_shipped_help_text' => 'Заповніть інформацію про доставку товару.',
    'general' => 'Інформація про товар',
    'status' => 'Доступність товару',
    'featured_help_text' => 'Цей товар буде позначено як рекомендований.',
    'visible_help_text' => 'Цей товар буде приховано з усіх каналів продажу.',
    'availability_description' => 'Вкажіть дату публікації, щоб товари були заплановані в магазині.',
    'type' => 'Тип товару',
    'product_type' => 'Встановити як типовий тип товару',
    'product_type_helpText' => 'Це налаштування буде збережено для наступних товарів, які ви створите.',
    'product_associations' => 'Асоціації',
    'related_products' => 'Схожі товари',
    'quantity_available' => 'Доступна кількість',
    'current_qty_inventory' => 'Поточна кількість на цьому складі',
    'stock_inventory_heading' => 'Склад та інвентаризація',
    'stock_inventory_description' => 'Налаштуйте склад та запас для :item',
    'files_helpText' => 'Додайте файли, які будуть доступні для скачування при покупці цього товару.',
    'images_helpText' => 'Додайте зображення до товару.',
    'variant_images_helpText' => 'Додайте зображення до варіанта.',
    'thumbnail_helpText' => 'Використовується для відображення товару при оформленні, в соціальних мережах і т.д.',
    'weight_dimension' => 'Вага та розміри',
    'weight_dimension_help_text' => 'Використовується для розрахунку вартості доставки при оформленні та відображення цін при обробці замовлень.',
    'external_id_description' => 'Оригінальний ідентифікатор товару від зовнішнього постачальника',
    'allow_backorder' => 'Дозволити передзамовлення',

    'modals' => [
        'title' => 'Видалити :item',
        'message' => 'Ви впевнені, що хочете видалити цей товар? Вся інформація, повʼязана з товаром, буде видалена.',

        'variants' => [
            'title' => 'Управління складом для цього варіанта',
            'select' => 'Виберіть склад',
            'add' => 'Додати новий варіант',
            'options' => [
                'title' => 'Атрибути варіанта',
                'description' => 'Виберіть опції атрибутів для цього варіанта.',
            ],
        ],
    ],

    'variants' => [
        'menu' => 'Варіанти',
        'single' => 'варіант',
        'title' => 'Варіації товарів',
        'description' => 'Всі варіації вашого товару. Варіації можуть мати свій склад та ціну.',
        'add' => 'Додати варіант',
        'generate' => 'Генерувати варіанти',
        'generate_description' => 'Варіанти генеруються на основі вибраних атрибутів',
        'variant_title' => 'Варіанти ~ :name',
        'empty' => 'Варіантів не знайдено',
        'search_label' => 'Пошук варіанта',
        'search_placeholder' => 'Пошук варіанта товару',
        'variant_information' => 'Інформація про варіант',
    ],

    'reviews' => [
        'single' => 'відгук',
        'title' => 'Відгуки клієнтів',
        'description' => 'Тут ви бачитимете відгуки клієнтів та оцінки товарів.',
        'view' => 'Відгуки для :product',
        'published' => 'Опубліковано',
        'pending' => 'На розгляді',
        'approved' => 'Затверджений відгук',
        'is_recommended' => 'Рекомендований відгук',
        'approved_status' => 'Статус затвердження',
        'approved_message' => 'Статус затвердження відгуку оновлено!',

        'subtitle' => 'Відгук для цього товару.',
        'reviewer' => 'Автор відгуку',
        'review' => 'Відгук',
        'review_content' => 'Контент',
        'status' => 'Статус',
        'rating' => 'Оцінка',
        'star' => 'зірка',
        'stars' => 'зірок',

        'modal' => [
            'title' => 'Видалити відгук',
            'description' => 'Ви впевнені, що хочете видалити цей відгук? Відгук не можна буде відновити.',
            'success_message' => 'Відгук успішно видалено!',
        ],
    ],

    'attributes' => [
        'title' => 'Атрибути товару',
        'description' => 'Всі атрибути, повʼязані з цим товаром.',
        'choose' => 'Виберіть атрибути',
        'empty_title' => 'Увімкнені атрибути відсутні',
        'empty_values' => 'Атрибути, повʼязані з цим товаром, перелічені тут.',

        'session' => [
            'delete' => 'Атрибут видалено',
            'delete_message' => 'Атрибут успішно видалено з товару!',
            'delete_value' => 'Значення атрибута видалено',
            'delete_value_message' => 'Значення атрибута успішно видалено!',
            'added' => 'Атрибут додано',
            'added_message' => 'Атрибути успішно додано до товару!',
        ],
    ],

    'inventory' => [
        'title' => 'Атрибути склада',
        'description' => 'Поля, повʼязані з управлінням складом у магазині.',
        'stock_title' => 'Управління складом',
        'stock_description' => 'Управління складом на різних складах.',
        'empty' => 'Коригування складу не виконано.',
        'movement' => 'Рух кількості',
        'initial' => 'Початковий склад',
        'add' => 'Додано вручну',
        'remove' => 'Видалено вручну',
    ],

    'shipping' => [
        'description' => 'Інформація про повернення товару або визначення, чи товар може бути доставлений клієнту.',
        'package_dimension' => 'Розміри пакунка',
        'package_dimension_description' => 'Додаткові витрати на доставку на основі розмірів пакунка.',
    ],

    'related' => [
        'title' => 'Схожі товари',
        'description' => 'Всі товари, які можуть бути схожими або доповнювати ваш товар.',
        'empty' => 'Схожих товарів не знайдено',
        'add_content' => 'Почніть з додавання схожого товару до вашого товару.',

        'modal' => [
            'title' => 'Додати схожі товари',
            'search' => 'Пошук товару',
            'search_placeholder' => 'Пошук товару по назві',
            'action' => 'Додати вибрані товари',
            'success_message' => 'Вибрані товари додано',
            'no_results' => 'Товарів не знайдено',
        ],
    ],

    'notifications' => [
        'files_update' => 'Файли товару оновлено!',
        'media_update' => 'Медіа товару оновлено!',
        'replicated' => 'Товар скопійовано!',
        'stock_update' => 'Склад товару успішно оновлено!',
        'seo_update' => 'SEO товару успішно оновлено!',
        'shipping_update' => 'Доставку товару успішно оновлено!',
        'variation_generate' => 'Варіанти товару успішно збережено',
        'variation_create' => 'Варіант товару успішно додано!',
        'variation_delete' => 'Варіант успішно видалено!',
        'variation_update' => 'Варіант успішно оновлено!',
        'related_added' => 'Товар успішно додано до схожих товарів!',
        'remove_related' => 'Товар успішно видалено з схожих товарів!',
        'manage_pricing' => 'Ціноутворення товару оновлено!',
        'variant_already_exists' => 'Цей варіант вже існує!',
    ],

    'pricing' => [
        'title' => 'Ціноутворення товару',
        'description' => 'Різні ціни, повʼязані з товаром. Залежить від валют у вашому магазині.',
        'add' => 'Додати нову ціну',
        'empty' => 'Ціноутворення товару не додано',
    ],

];
