<?php

declare(strict_types=1);

return [

    'permissions' => [
        'new' => 'Новий дозвіл',
        'new_description' => 'Додати новий дозвіл і одразу призначити його до цієї ролі',
        'labels' => [
            'name' => 'Назва дозволу (малі літери)',
        ],
    ],

    'roles' => [
        'new' => 'Додати нову роль',
        'new_description' => 'Додати нову роль і призначити дозволи для адміністраторів.',
        'labels' => [
            'name' => 'Назва (малі літери)',
        ],
        'confirm_delete_msg' => 'Ви впевнені, що хочете видалити цю роль? Всі користувачі з цією роллю втратять доступ до дій, які надає ця роль',
    ],

    'attributes' => [
        'new_value' => 'Додати нове значення для :attribute',
        'key_description' => 'Ключ буде використовуватися для значень у формах (вибір, радіо-кнопки і т.д.). Має бути у форматі slug',
        'update_value' => 'Оновити значення для :name',
    ],

    'inventories' => [
        'confirm_delete_msg' => 'Ви впевнені, що хочете видалити цей склад? Всі дані будуть видалені. Цю дію не можна скасувати',
    ],

];
