<?php

declare(strict_types=1);

return [

    'save' => ':item успішно збережено',
    'create' => ':item успішно створено',
    'update' => ':item успішно оновлено',
    'delete' => ':item успішно видалено',
    'enabled' => ':item успішно увімкнено',
    'disabled' => ':item успішно вимкнено',
    'verified' => ':item успішно підтверджено',
    'approved' => ':item успішно затверджено',
    'disapproved' => ':item успішно відхилено',
    'visibility' => 'Видимість :item успішно оновлено',
    'saved' => 'Збережено',

    'attributes' => [
        'remove' => 'Атрибут успішно видалено',
        'enable' => 'Атрибут успішно увімкнено',
        'disable' => 'Атрибут успішно вимкнено',
    ],

    'auth' => [
        'password' => 'Цей пароль не відповідає нашим записам.',
    ],

    'analytics' => 'Налаштування аналітики успішно оновлено',

    'store_info' => 'Інформацію про магазин успішно оновлено',

    'inventory' => [
        'removed' => 'Склад успішно видалено.',
    ],

    'initialize' => 'Магазин успішно налаштовано, тепер ви можете управляти всім.',

    'legal' => 'Юридичну політику успішно оновлено',

    'users_roles' => [
        'role_added' => 'Роль успішно створено',
        'role_deleted' => 'Роль успішно видалено.',
        'admin_deleted' => 'Адміністратора успішно видалено',
        'permission_add' => 'Новий дозвіл створено та додано до цієї ролі',
        'permission_revoke' => 'Дозвіл :permission відкликано для цієї ролі',
        'permission_allow' => 'Дозвіл :permission надано для цієї ролі',
        'password_changed' => 'Пароль успішно оновлено',
        'current_password' => 'Це не ваш поточний пароль.',
        'profile_update' => 'Профіль успішно оновлено',
        'two_factor_enabled' => 'Двофакторну автентифікацію успішно увімкнено',
        'two_factor_disabled' => 'Двофакторну автентифікацію успішно вимкнено',
        'two_factor_generate' => 'Коди відновлення двофакторної автентифікації успішно перегенеровано.',
    ],

    'orders' => [
        'archived' => 'Замовлення успішно архівовано',
    ],

    'payment' => [
        'add' => 'Спосіб оплати успішно збережено!',
        'update' => 'Спосіб оплати успішно оновлено',
    ],

    'carrier' => [
        'add' => 'Перевізника успішно додано!',
        'update' => 'Перевізника успішно оновлено.',
    ],

    'products' => [
        'remove' => ':item успішно видалено.',
    ],

    'unauthorized' => [
        'title' => 'Несанкціонований доступ',
        'body' => 'Ви не маєте дозволу на виконання цієї дії.',
    ],

];
