<?php

declare(strict_types=1);

return [

    'menu' => 'Налаштування',
    'single' => 'налаштування',

    'empty_country_selector' => 'Виберіть країну',
    'logo_description' => 'Логотип магазину, який буде видимий на сайті. Ці ресурси відображатимуться на рахунках.',
    'confirm_password_content' => 'Для безпеки підтвердіть пароль, щоб продовжити.',

    'general' => [
        'title' => 'Налаштування магазину',
        'store_details' => 'Деталі магазину',
        'store_detail_summary' => 'Клієнти використовуватимуть цю інформацію для звʼязку з вами.',
        'email_helper' => 'Клієнти використовуватимуть цю адресу, якщо потрібно звʼязатися з вами.',
        'phone_number_helper' => 'Клієнти використовуватимуть цей номер, якщо потрібно зателефонувати напряму.',
        'assets' => 'Ресурси',
        'assets_summary' => 'Логотип та обкладинка магазину, які будуть видимі на сайті. Ці ресурси відображатимуться на рахунках.',
        'store_address' => 'Адреса магазину',
        'store_address_summary' => 'Ця адреса відображатиметься на рахунках. Ви можете редагувати використану адресу.',
        'store_currency' => 'Валюта магазину',
        'social_links' => 'Соціальні посилання',
        'social_links_summary' => 'Інформація про ваші акаунти в соціальних мережах. Користувачі зможуть звʼязатися з вами напряму на офіційних сторінках.',
    ],

    'location' => [
        'menu' => 'Місця',
        'single' => 'місце',
        'description' => 'Управління місцями зберігання товарів, виконання замовлень та продажу.',
        'count' => 'У вас налаштовано :count місць.',
        'add' => 'Додати місце',
        'detail' => 'Деталі',
        'detail_summary' => 'Дайте цьому місцю коротку назву для легкої ідентифікації. Ви бачитимете цю назву в розділах, таких як товари.',
        'address' => 'Адреса місця',
        'address_summary' => 'Повна інформація про місцезнаходження. Вкажіть достовірну інформацію, оскільки клієнти можуть отримати доступ до неї.',
        'set_default' => 'Встановити як типове місце',
        'set_default_summary' => 'Товари на цьому складі доступні для онлайн-продажу та використовуються як типові',
        'priority_summary' => 'Менші значення виконуються першими при розподілі товарів між кількома місцями.',
        'is_default' => 'Це ваше типове місце. Щоб змінити, з якого місця виконуються онлайн-замовлення, спочатку виберіть інше типове місце.',
    ],

    'analytics' => [
        'google' => 'Google Analytics',
        'google_description' => 'Google Analytics дозволяє відстежувати відвідувачів сайту та генерувати звіти для маркетингу.',
        'gtag' => 'Google Tag Manager',
        'gtag_description' => 'Google Tag Manager дозволяє маркетологам легко додавати теги (Analytics, remarketing і т.д.)',
        'pixel' => 'Facebook Pixel',
        'pixel_description' => 'Facebook Pixel допомагає створювати рекламні кампанії для пошуку нових клієнтів, схожих на ваших покупців.',
        'no_json' => 'JSON-файл не додано',
    ],

    'legal' => [
        'title' => 'Юридична політика',
        'refund' => 'Політика повернення',
        'privacy' => 'Політика конфіденційності',
        'shipping' => 'Політика доставки',
        'terms_of_use' => 'Умови використання',
        'summary' => 'Визначте :policy, до якої підпадають всі користувачі та покупці товарів у магазині.',
    ],
];
