<?php

declare(strict_types=1);

return [

    'general' => 'Загальні',
    'general_description' => 'Переглянути та оновити інформацію магазину.',
    'staff' => 'Персонал та дозволи',
    'staff_description' => 'Переглянути та управляти тим, що персонал може бачити або робити в магазині.',
    'location' => 'Склади',
    'location_description' => 'Управління місцями зберігання товарів та продажу.',
    'analytic' => 'Аналітика',
    'analytic_description' => 'Налаштування для кращого розуміння джерел трафіку.',
    'payment' => 'Способи оплати',
    'payment_description' => 'Додайте різні способи оплати для клієнтів.',
    'legal' => 'Юридичні',
    'legal_description' => 'Управління юридичними сторінками магазину, такими як конфіденційність та умови.',
    'carrier' => 'Перевізники',
    'carrier_description' => 'Управління перевізниками та провайдерами доставки.',
    'zone' => 'Зони',
    'zone_description' => 'Управління доставкою, оплатою та виконанням по зонах',
    'tax' => 'Податки',
    'tax_description' => 'Управління способом стягнення податків у магазині.',
    'currency' => 'Валюти',
    'currency_description' => 'Увімкнення валют та управління обмінними курсами.',
    'sales' => 'Канали продажу',
    'sales_description' => 'Управління онлайн та офлайн каналами продажу товарів.',

];
