<?php

declare(strict_types=1);

return [

    'title' => 'Ролі та управління доступом',
    'header_title' => 'Адміністратори та ролі',
    'role_available' => 'Доступні ролі адміністратора',
    'role_available_summary' => 'Роль надає доступ до передвизначених меню та функцій, щоб адміністратор залежно від призначеної ролі та дозволів міг отримати доступ до необхідних функцій.',
    'new_role' => 'Додати нову роль',
    'admin_accounts' => 'Акаунти адміністраторів',
    'admin_accounts_summary' => 'Це учасники, які вже є в магазині з відповідними ролями. Тут ви можете призначити нові ролі існуючим учасникам.',
    'add_admin' => 'Додати адміністратора',
    'users_role' => 'Користувачі та ролі',
    'login_information' => 'Дані для входу',
    'login_information_summary' => 'Ця інформація буде необхідна адміністратору для входу в панель адміністрації Shopper.',
    'send_invite' => 'Відправити запрошення',
    'send_invite_summary' => 'Відправити запрошення цьому адміністратору по email з даними для входу.',
    'personal_information' => 'Персональна інформація',
    'personal_information_summary' => 'Інформація, повʼязана з профілем адміністратора.',
    'role_information' => 'Інформація про роль',
    'role_information_summary' => 'Призначте ролі цьому адміністратору, які обмежать його дії.',
    'roles' => 'Ролі',
    'role' => 'Роль',
    'permission' => 'Дозвіл',
    'permissions' => 'Дозволи',
    'choose_role' => 'Виберіть роль для цього адміністратора',
    'create_permission' => 'Створити дозвіл',
    'generate_permissions' => 'Генерувати дозволи',
    'generate_permissions_description' => 'Введіть назву ресурсу для автоматичної генерації 5 стандартних CRUD-дозволів та їх призначення до цієї ролі.',
    'resource_name' => 'Назва ресурсу',
    'permissions_preview' => 'Дозволи, які будуть створені',
    'role_alert_msg' => 'Ви збираєтеся оновити роль адміністратора, це може заблокувати ваш доступ до панелі.',
    'with_role_name' => 'з роллю :name',
    'permissions_in_role' => 'в ролі :name',
    'custom_permission' => 'Кастомний дозвіл',
    'delete_team_member' => 'Ви впевнені, що хочете видалити цього учасника?',

];
