<?php

declare(strict_types=1);

return [

    'title' => 'Зони',
    'single' => 'Зона',
    'description' => 'Зони представляють ринки, на яких ви працюєте.',
    'add_action' => 'Додати зону',
    'empty_heading' => 'Зон немає',
    'providers' => 'Провайдери',
    'providers_description' => 'Додайте способи доставки та оплати, які мають бути доступні в цій зоні.',
    'currency_help' => 'Основна валюта цієї зони зі списку валют, налаштованих при створенні магазину.',
    'empty_detail_heading' => 'Зону не вибрано',
    'empty_detail_description' => 'Після вибору зони вся її інформація буде доступна тут',

    'shipping_options' => [
        'title' => 'Варіанти доставки',
        'single' => 'Варіант доставки',
        'description' => 'Вкажіть деталі доступних способів доставки в зоні.',
        'option_visibility' => 'Увімкнути або вимкнути видимість варіанта доставки в магазині.',
        'add' => 'Додати варіант',
        'add_heading' => 'Варіант доставки для зони :name',
        'update' => 'Оновити варіант (:name)',
        'empty_heading' => 'Варіанти доставки недоступні',
    ],

];
